Documents/УведомлениеОСпецрежимахНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УведомлениеОСпецрежимахНалогообложения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУведомленийОСпецрежимахНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеУведомления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантПризнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантФамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантОтчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУведомления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/КадровыйУчетВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// КадровыйУчетВызовСервера: методы кадрового учета, работающие на стороне сервера.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ИсключитьПовторениеЗаписейТекущихДанныхСотрудников(ИмяРегистраТекущихСведений) Экспорт
	
	КадровыйУчет.ИсключитьПовторениеЗаписейТекущихДанныхСотрудников(ИмяРегистраТекущихСведений);
	
КонецПроцедуры

Процедура ИсключитьЗадвоениеОсновныхРабочихМестТекущихДанныхСотрудников() Экспорт
	
	КадровыйУчет.ИсключитьЗадвоениеОсновныхРабочихМестТекущихДанныхСотрудников();
	
КонецПроцедуры

Функция КадровыеДанныеСотрудника(Сотрудник, КадровыеДанные, Период) Экспорт
	
	Если ТипЗнч(КадровыеДанные) = Тип("Строка") Тогда
		КлючиСтруктуры = "Период,Сотрудник," + КадровыеДанные;
	Иначе
		КлючиСтруктуры = "Период,Сотрудник," + СтрСоединить(КадровыеДанные, ",");
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура(КлючиСтруктуры, Период, Сотрудник);
	
	МассивКадровыхДанных = КадровыеДанныеСотрудников(Сотрудник, КадровыеДанные, Период);
	Если МассивКадровыхДанных.Количество() > 0 Тогда
		Возврат МассивКадровыхДанных[0];
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(СтруктураВозврата);
	
КонецФункции

Функция КадровыеДанныеСотрудников(Сотрудники, КадровыеДанные, Период)
	
	Если ТипЗнч(КадровыеДанные) = Тип("Строка") Тогда
		КлючиСтруктуры = "Период,Сотрудник," + КадровыеДанные;
	Иначе
		КлючиСтруктуры = "Период,Сотрудник," + СтрСоединить(КадровыеДанные, ",");
	КонецЕсли;
	
	ВозвращаемыйМассив = Новый Массив;
	ТаблицаКадровыхДанных = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, Сотрудники, КадровыеДанные, Период);
	Для каждого СтрокаТаблицаКадровыхДанных Из ТаблицаКадровыхДанных Цикл
		
		СтруктураВозврата = Новый Структура(КлючиСтруктуры, Период);
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, СтрокаТаблицаКадровыхДанных);
		
		ВозвращаемыйМассив.Добавить(Новый ФиксированнаяСтруктура(СтруктураВозврата));
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(ВозвращаемыйМассив);
	
КонецФункции

Функция ДокументыПоИностраннымГражданам(ВидУведомления, Основание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидУведомления", ВидУведомления);
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УведомлениеОСпецрежимахНалогообложения.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УведомлениеОСпецрежимахНалогообложения КАК УведомлениеОСпецрежимахНалогообложения
		|ГДЕ
		|	УведомлениеОСпецрежимахНалогообложения.ВидУведомления = &ВидУведомления
		|	И УведомлениеОСпецрежимахНалогообложения.Основание = &Основание
		|	И НЕ УведомлениеОСпецрежимахНалогообложения.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ДанныеЗаполненияДокументовПоИностраннымГражданам(ВидУведомления, Основание) Экспорт
	
	ДанныеДляЗаполнения = Новый Структура("Организация");
	
	ДанныеДокумента = Новый Структура(
		"Организация,
		|ДатаДокумента,
		|ДатаСведений,
		|ДатаНачала,
		|ДатаОкончания,
		|Сотрудник,
		|Должность,
		|ТрудовойДоговор,
		|ДоговорГПХ,
		|РазрешениеНаРаботу");
	
	Если Не КадровыйУчет.ЗаполнитьДанныеДокументовПоИностраннымГражданам(
		ДанныеДокумента, Основание) Тогда
		
		ДанныеДляЗаполнения.Вставить(
			"ДанныеЗаполнения", Отчеты.РегламентированноеУведомлениеРаботаИностранцев.КонтейнерЗаполнения(ВидУведомления));
		ДанныеДляЗаполнения.ДанныеЗаполнения.Основание = Основание;
		
		Возврат ДанныеДляЗаполнения;
	КонецЕсли;
	
	Если ДанныеДокумента.ДатаСведений >= '20260901' Тогда
		ДанныеДляЗаполнения.Вставить(
			"ДанныеЗаполнения", Отчеты.РегламентированноеУведомлениеРаботаИностранцев.КонтейнерЗаполнения(
				ВидУведомления, "2026"));
	Иначе
		ДанныеДляЗаполнения.Вставить(
			"ДанныеЗаполнения", Отчеты.РегламентированноеУведомлениеРаботаИностранцев.КонтейнерЗаполнения(
				ВидУведомления, "2023"));
	КонецЕсли;
	ДанныеДляЗаполнения.ДанныеЗаполнения.Основание = Основание;
	
	ИменаКадровыхДанных = "ФИОПолные,Фамилия,Имя,Отчество,ДатаРождения,Страна,МестоРождения,Пол,"
		+ "ИНН,ДокументВид,ДокументСерия,ДокументНомер,ДокументДатаВыдачи,ДокументКемВыдан,"
		+ "Страна,ПриказОПриеме,Должность,АдресПоПропискеПредставление";
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная.КонтрактыДоговорыСотрудников") Тогда
		ИменаКадровыхДанных = ИменаКадровыхДанных + ",ДатаДоговораКонтракта,ТрудовойДоговорДатаНачала,ДатаОкончания";
	КонецЕсли;
	
	КадровыеДанныеСотрудника = КадровыеДанныеСотрудника(ДанныеДокумента.Сотрудник, ИменаКадровыхДанных, ДанныеДокумента.ДатаСведений);
	
	Если КадровыеДанныеСотрудника.Страна = Справочники.СтраныМира.Россия Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = '%1 не является иностранным гражданином'"), ДанныеДокумента.Сотрудник);
	КонецЕсли;
	
	ДанныеДляЗаполнения.Вставить("Организация", ДанныеДокумента.Организация);
	
	Данные = ДанныеДляЗаполнения.ДанныеЗаполнения.Данные.Титульная;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Описание32п") Тогда
		Данные.Описание32п = Строка(ДанныеДокумента.Должность);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "ДокументРазр") Тогда
		Данные.ДокументРазр = ДанныеДокумента.РазрешениеНаРаботу;
	КонецЕсли;
	
	Если ДанныеДокумента.ТрудовойДоговор = Истина Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Флаг9") Тогда
			Данные.Флаг9 = "X";
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеДокумента.ДоговорГПХ = Истина Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Флаг10") Тогда
			Данные.Флаг10 = "X";
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "ФИОПД") Тогда
		Данные.ФИОПД = КадровыеДанныеСотрудника.ФИОПолные;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "АдресПД") Тогда
		Данные.АдресПД = КадровыеДанныеСотрудника.АдресПоПропискеПредставление;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "ПаспортСерияПД") Тогда
		Данные.ПаспортСерияПД = КадровыеДанныеСотрудника.ДокументСерия;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "ПаспортНомерПД") Тогда
		Данные.ПаспортНомерПД = КадровыеДанныеСотрудника.ДокументНомер;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "ПаспортВыданПД") Тогда
		Данные.ПаспортВыданПД = СтрШаблон("%1, %2", 
			Формат(КадровыеДанныеСотрудника.ДокументДатаВыдачи, "ДЛФ=D"),
			КадровыеДанныеСотрудника.ДокументКемВыдан);
	КонецЕсли;
	
	Если ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаключениеТрудовогоДоговора Тогда
		ДатаНачала = '00010101';
		ДатаОкончания = '00010101';
		Если ДанныеДокумента.ДоговорГПХ = Истина Тогда
			Если ЗначениеЗаполнено(ДанныеДокумента.ДатаОкончания) Тогда
				ДатаНачала = ДанныеДокумента.ДатаНачала;
				ДатаОкончания = ДанныеДокумента.ДатаОкончания;
			КонецЕсли;
		Иначе
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(КадровыеДанныеСотрудника, "ДатаОкончания")
				И ЗначениеЗаполнено(КадровыеДанныеСотрудника.ДатаОкончания) Тогда
				
				ДатаНачала = КадровыеДанныеСотрудника.ТрудовойДоговорДатаНачала;
				ДатаОкончания = КадровыеДанныеСотрудника.ДатаОкончания;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "СрокС33п") Тогда
				Данные.СрокС33п = ДатаНачала;
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "СрокПо33п") Тогда
				Данные.СрокПо33п = ДатаОкончания;
			КонецЕсли;
		Иначе
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Флаг13") Тогда
				Данные.Флаг13 = "X";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "ИННСпециалист") Тогда
		Данные.ИННСпециалист = КадровыеДанныеСотрудника.ИНН;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Фамилия") Тогда
		Данные.Фамилия = КадровыеДанныеСотрудника.Фамилия;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "ФамилияРус") Тогда
		Данные.ФамилияРус = КадровыеДанныеСотрудника.Фамилия;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Имя") Тогда
		Данные.Имя = КадровыеДанныеСотрудника.Имя;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "ИмяРус") Тогда
		Данные.ИмяРус = КадровыеДанныеСотрудника.Имя;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Отчество") Тогда
		Данные.Отчество = КадровыеДанныеСотрудника.Отчество;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "ОтчествоРус") Тогда
		Данные.ОтчествоРус = КадровыеДанныеСотрудника.Отчество;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Пол") Тогда
		Данные.Пол = Строка(КадровыеДанныеСотрудника.Пол);
	ИначеЕсли ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаключениеТрудовогоДоговора Тогда
		Если КадровыеДанныеСотрудника.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Флаг12") Тогда
				Данные.Флаг12 = "V";
			КонецЕсли;
		Иначе
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Флаг11") Тогда
				Данные.Флаг11 = "V";
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.РасторжениеТрудовогоДоговора Тогда
		Если КадровыеДанныеСотрудника.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Флаг14") Тогда
				Данные.Флаг14 = "V";
			КонецЕсли;
		Иначе
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Флаг13") Тогда
				Данные.Флаг13 = "V";
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ОбязательстваВыплатаЗП Тогда
		Если КадровыеДанныеСотрудника.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Флаг17") Тогда
				Данные.Флаг17 = "V";
			КонецЕсли;
		Иначе
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Флаг16") Тогда
				Данные.Флаг16 = "V";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Данные.ДатаРождения = КадровыеДанныеСотрудника.ДатаРождения;
	Данные.Гражданство = Строка(КадровыеДанныеСотрудника.Страна);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "МестоРождения") Тогда
		Данные.МестоРождения = ПредставлениеМестаРождения(КадровыеДанныеСотрудника.МестоРождения);
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "МестоРожденияГосударство") Тогда
		Данные.МестоРожденияГосударство = ГосударствоМестаРождения(КадровыеДанныеСотрудника.МестоРождения);
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "МестоРожденияНаселенныйПункт") Тогда
		Данные.МестоРожденияНаселенныйПункт = НаселенныйПунктМестаРождения(КадровыеДанныеСотрудника.МестоРождения);
	КонецЕсли;
		
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "Документ") Тогда
		Данные.Документ = Строка(КадровыеДанныеСотрудника.ДокументВид);
	КонецЕсли;
	
	Данные.Серия = КадровыеДанныеСотрудника.ДокументСерия;
	Данные.Номер = КадровыеДанныеСотрудника.ДокументНомер;
	Данные.ДатаВыдачи = КадровыеДанныеСотрудника.ДокументДатаВыдачи;
	Данные.КемВыдан = КадровыеДанныеСотрудника.ДокументКемВыдан;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Данные, "ДатаДоговора") Тогда
		Если ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.РасторжениеТрудовогоДоговора Тогда
			Данные.ДатаДоговора = ДанныеДокумента.ДатаСведений;
		Иначе
			Если ДанныеДокумента.ДоговорГПХ <> Истина
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(КадровыеДанныеСотрудника, "ДатаДоговораКонтракта") Тогда
				
				Данные.ДатаДоговора = КадровыеДанныеСотрудника.ДатаДоговораКонтракта;
			Иначе
				Данные.ДатаДоговора = ДанныеДокумента.ДатаДокумента;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеДляЗаполнения;
	
КонецФункции

Функция ПредставлениеМестаРождения(МестоРождения)
	
	ДанныеОМестеРождения = ПерсонифицированныйУчетКлиентСервер.РазложитьМестоРождения(МестоРождения, Ложь);
	Если ЗначениеЗаполнено(ДанныеОМестеРождения.Страна) Тогда
		Если ЗначениеЗаполнено(ДанныеОМестеРождения.НаселенныйПункт) Тогда
			Возврат СтрШаблон("%1, %2", ДанныеОМестеРождения.Страна, ДанныеОМестеРождения.НаселенныйПункт)
		Иначе
			Возврат ДанныеОМестеРождения.Страна;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеОМестеРождения.НаселенныйПункт;
	
КонецФункции

Функция ГосударствоМестаРождения(МестоРождения)
	
	ДанныеОМестеРождения = ПерсонифицированныйУчетКлиентСервер.РазложитьМестоРождения(МестоРождения, Ложь);
	Возврат ДанныеОМестеРождения.Страна;
	
КонецФункции

Функция НаселенныйПунктМестаРождения(МестоРождения)
	
	ДанныеОМестеРождения = ПерсонифицированныйУчетКлиентСервер.РазложитьМестоРождения(МестоРождения, Ложь);
	Возврат ДанныеОМестеРождения.НаселенныйПункт;
	
КонецФункции

#КонецОбласти
